# По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b, проходящей через эти точки.
print ("Введите первую координату точки А")
x1 = float(input('x1 = '))
print ("Введите вторую координату точки А")
y1 = float(input('y1 = '))
print ("Введите первую координату точки В")
x2 = float(input('x2 = '))
print ("Введите вторую координату точки В")
y2 = float(input('y2 = '))

if x1 == x2:
    print(f'x = {x1:.2f}')
else:
    k = (y1 -y2) / (x1 - x2)
    b = y2 - k * x2
    print(f'y  = {k:.f} * x + {b:.3f}')